slipperstree/MyMcu51Prog/STC12C5A60S2/01_16x64LED/16x64LED_For89C52.c
				if(bufByteIdx >= 24 && bufByteIdx < 32 ){
					for (icByteIdx=24; icByteIdx<32; icByteIdx++){
						pTmpByteBufHZ[0] <<= 1;
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							pTmpByteBufHZ[0] |= 0x01;
						} else {
							// 否则赋值0
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
			}
			break;
		case 16:
			// 半角ACSII符号
			// 半角字符的IC点阵数据8列X16行: B0-B7为点阵的上8行数据，B8-B15为点阵的下8行数据（见上面的字符A的例子）
			// 所以大buff的B0-B7 的数据从IC数据的B0-B7 中取出来（行列互换）
			//   而大buff的B8-B15的数据从IC数据的B8-B15中取出来（行列互换）
			for (bufByteIdx=0; bufByteIdx<size; bufByteIdx++){
				//display();//test
					
				pTmpByteBufHZ = &(bufHZ[pos*16 + bufByteIdx]);
				
				// 先清空目标字节
				pTmpByteBufHZ[0] = 0x00;
				
				if(bufByteIdx < 8){
					for (icByteIdx=0; icByteIdx<8; icByteIdx++){
						// 每次给最低位赋值后左移一位，最后得到8位数据
						pTmpByteBufHZ[0] <<= 1;
						
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							// 如果ic的该位数据是1，则给缓冲字节最低位赋值1
							pTmpByteBufHZ[0] |= 0x01; // 0000 0001
						} else {
							// 否则赋值0，默认是0所以什么都不做
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
				
				if(bufByteIdx >= 8 && bufByteIdx < 16 ){
					for (icByteIdx=8; icByteIdx<16; icByteIdx++){
						// 每次给最低位赋值后左移一位，最后得到8位数据
						pTmpByteBufHZ[0] <<= 1;
						
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							// 如果ic的该位数据是1，则给缓冲字节最低位赋值1
							pTmpByteBufHZ[0] |= 0x01; // 0000 0001
						} else {
							// 否则赋值0，默认是0所以什么都不做
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
			}
			break;
		default:
			break;
	}
	
}

// 暂时只支持最前面的8个字节的显示（8个半角或4个全角）
void readICDataToBuffer(uchar* str){
	uchar pos;
	
	// GB2312-80编码的编码范围是高位0xa1－0xfe，低位是 0xa1-0xfe ，
	// 其中汉字范围为 0xb0a1 和 0xf7fe，如果只是简单地判断汉字，则只要查看高字节是否大于等于0xa1就可以了
	for (pos=0; pos<8; pos++){
		if (str[pos] >= 0x20 && str[pos] <= 0x7E) {
			// 判定为半角ASCII码，调用ASCII码的取点阵函数并存放在当前的显示位置上
			setICDataToBuffer(getICData_ASCII_8x16(str[pos]), 16, pos); 
		} else {
			// 判定为全角汉字（其实还有很多别的可能比如日文汉字，这里我们默认输入的字符串是GB2312编码）
			// 调用汉字的取点阵函数并存放在当前的显示位置上
			setICDataToBuffer(getICData_Hanzi_16x16(&str[pos]), 32, pos);
			pos++;//由于汉字占两个字节，这里手动让循环变量跳过下一个字节
		}
	}
}

// 取得点阵数据
// addr: 计算好的点阵数据的起始地址
// size：从起始地址连续取多少字节的点阵数据，目前只支持16（ASCII码）和32（GB2312汉字）两种
uchar* getICData(unsigned long addr, uchar size) {
	
	//init
	pCE=1;
	pSI=0;
	pSCLK=0;
	
	//memset(ic_data, 32, 0x00);
	
	// 首先把片选信号（CS#）变为低
	pCE=0;
	
	// 紧跟着的是通过串行数据输入引脚（SI）移位输入 1 个字节的命令字（03 h）
	// 每一位在串行时钟（SCLK）上升沿被锁存。
	for (idx = 0; idx<8; idx++){
		pSCLK=0;
		pSI=0x03<<idx & 0x80;
		pSCLK=1;
	}
	
	// 然后继续通过串行数据输入引脚（SI）移位输入 3 个字节的地址
	// 每一位在串行时钟（SCLK）上升沿被锁存。
	for (idx = 0; idx<24; idx++){
		pSCLK=0;
		pSI=addr<<idx & 0x800000;
		
		// For test break point
		if(idx==23){
			idx = 23;
		}
		
		pSCLK=1;
	}
	
	// 经过仔细调试发现，芯片返回数据的时间线跟官方文档有所出入
	// 官方文档给出的时间线是传输完命令的最后一位以后的第一个SCLK的下降沿会从MO传回第一个字节的最高位，
	// 实际上，在传输命令的最后一个上升沿的瞬间，MO就已经开始往回传数据了，然后紧接着就会在每个下降沿传回后面的数据
	// 不知道为什么，但我手上的芯片确实如此，导致一开始总是缺少第一位数据
	// 所以在下面的循环之前先取第一位的数据
	
	// 奇怪，用stc12c5a60s2时，时序又没有问题了，搞不懂。。。下面两句暂时不用了。。。
	// 如果用了下面两句，表现为整个显示多网上位移一位。。。
	//ic_data[0] = ic_data[0] | pSO;
	//ic_data[0] <<= 1;
	
	// 然后芯片会将该地址的字节数据通过串行数据输出引脚（SO）移位输出，
	// 每一位在串行时钟（SCLK）下降沿被移出。
	// 由于第一位数据已经取过了，所以下面的循环从1而不是0开始
	for (idx = 0; idx<8*size ; idx++){
		pSCLK=0;
		
		// 每次产生下降沿，IC会继续返回一位点阵数据
		// 取得这一位点阵数据存放在当前字节的最低位
		// 注意，位赋值时不可以直接用或运算！！因为这种做法无法将原来的1改成0！！
		//       结果就是屏幕上最后一行会出现无规则的点，这些点都是从数组范围以外位移进来并且没有被置为0的点。（pSO=0）
		if (pSO == 0) {
			ic_data[idx/8] &= 0xFE; // 1111 1110 
		} else {
			ic_data[idx/8] |= 0x01; // 0000 0001
		}
		
		if(((idx+1)%8) > 0){
			// 进行左移以空出最低位以便继续接受下一位数据
			ic_data[idx/8] <<= 1;
		} else {
			// 每个字节只需要位移7次即可，最后一位，也就是真正的最低位的数据设置以后不再做左移
			// 否则会丢失最高位的数据，并产生点阵偏移
			//ic_data[idx/8] >>= 1;
		}
		
		pSCLK=1;
		
		//display();//test
	}
	
	// 读取字节数据后，则把片选信号（CS#）变为高，结束本次操作。
	pCE=1;
	return ic_data;
}

uchar* getICData_ASCII_8x16(uchar ch) {
	// ASCII字符所在地址的计算公式
	addr = (ch-0x20)*16+0x3b7c0;
	return getICData(addr, 16);
}

uchar* getICData_Hanzi_16x16(uchar* hz) {
	unsigned long hzGBCodeH8, hzGBCodeL8;
	
	// 由于后面有地址的计算，所以必须使用可容纳大数的long型作为中间变量，否则做地址运算时会溢出
	// 直接将uchar型赋值给long型的话，没有赋值到的高位有可能乱掉，所以跟0xFF相与一次，确保只留下uchar部分的数据
	hzGBCodeH8 = hz[0] & 0xFF;
	hzGBCodeL8 = hz[1] & 0xFF;
	
	// GB2312汉字所在地址的计算公式
	if(hzGBCodeH8 ==0xA9 && hzGBCodeL8 >=0xA1)
		addr = (282 + (hzGBCodeL8 - 0xA1 ))*32;
	else if(hzGBCodeH8 >=0xA1 && hzGBCodeH8 <= 0xA3 && hzGBCodeL8 >=0xA1)
		addr =( (hzGBCodeH8 - 0xA1) * 94 + (hzGBCodeL8 - 0xA1))*32;
	else if(hzGBCodeH8 >=0xB0 && hzGBCodeH8 <= 0xF7 && hzGBCodeL8 >=0xA1) {
		// addr = ((hzGBCodeH8 - 0xB0) * 94 + (hzGBCodeL8 - 0xA1)+ 846)*32;
		addr = (hzGBCodeH8 - 0xB0) * 94;
		addr += (hzGBCodeL8 - 0xA1) + 846;
		addr *= 32;
	}
	
	return getICData(addr, 32);
}

/*--------------------------------------------------------------
    点阵LED第几行显示数据
   其中*p为传输的点阵数据，han为第几行显示，zishu为显示多少个字
---------------------------------------------------------------*/
void HC595_Data_Send(uchar *p, uchar han, uchar offset)
{
	uchar i=0;
	uchar temp=0;
	uchar* data_buff;
	Latch_port = 0;  /*HC595锁定输出,避免数据传输过程中，屏数据变化从而显示闪烁*/
	CLK_port = 0;
	
	// 前面的4个汉字8个字节先送出去
	for(temp=0;temp<8;temp++){
		data_buff = &p[temp];
		for(i=0;i<8;i++){
			if(((data_buff[0]<<i)&0x80)!=0) DA_in_port = 0;
			else DA_in_port = 1;
			CLK_port = 1;
			CLK_port = 0;
		}
	}

	EN_port = 1; /*关屏显示，原理为使HC138输出全为1，从而三极管截止，点阵不显示*/

	ABCD_port = (ABCD_port & 0x0f)|(han<<4);

	Latch_port = 1; /*允许HC595数据输出到Q1-Q8端口*/
	EN_port = 0; /*HC138输出有效，打开显示*/
	Latch_port = 0;	/*锁定HC595数据输出*/
}

// 当前未使用该中断函数
void Timer0() interrupt 1
{
	// 30us一次
}

void UartInit(){
	#if (PARITYBIT == NONE_PARITY)
		SCON = 0x50;            //8-bit variable UART
	#elif (PARITYBIT == ODD_PARITY) || (PARITYBIT == EVEN_PARITY) || (PARITYBIT == MARK_PARITY)
		SCON = 0xda;            //9-bit variable UART, parity bit initial to 1
	#elif (PARITYBIT == SPACE_PARITY)
		SCON = 0xd2;            //9-bit variable UART, parity bit initial to 0
	#endif

	TMOD = 0x20;            //Set Timer1 as 8-bit auto reload mode
	TH1 = TL1 = -(FOSC/6/32/BAUD); //Set auto-reload vaule(FOSC/6的这个6表示下载时指定了6T模式，如果是默认12T则改成12)
	TR1 = 1;                //Timer1 start run
	ES = 1;                 //Enable UART interrupt
	EA = 1;                 //Open master interrupt switch

	SendString("STC12C5A60S2\r\nUart Test !\r\n");
	//SendData("");
}

/*----------------------------
UART interrupt service routine
----------------------------*/
void Uart_Isr() interrupt 4 using 1
{
    if (RI)
    {
        RI = 0;             //Clear receive interrupt flag

SBUF=SBUF;
		if(SBUF == 0x55){
			serialRcvIdx=0;
		} else {
			serialRcvBuf[serialRcvIdx] = SBUF;
			serialRcvIdx++;
		}
		TR0=1;
    }
    if (TI)
    {
        TI = 0;             //Clear transmit interrupt flag
        busy = 0;           //Clear transmit busy flag
    }
}

/*----------------------------
Send a byte data to UART
Input: dat (data to be sent)
Output:None
----------------------------*/
void SendData(BYTE dat)
{
    while (busy){
	}           //Wait for the completion of the previous data is sent
    ACC = dat;              //Calculate the even parity bit P (PSW.0)
    if (P)                  //Set the parity bit according to P
    {
#if (PARITYBIT == ODD_PARITY)
        TB8 = 0;            //Set parity bit to 0
#elif (PARITYBIT == EVEN_PARITY)
        TB8 = 1;            //Set parity bit to 1
#endif
    }
    else
    {
#if (PARITYBIT == ODD_PARITY)
        TB8 = 1;            //Set parity bit to 1
#elif (PARITYBIT == EVEN_PARITY)
        TB8 = 0;            //Set parity bit to 0
#endif
    }
    busy = 1;
    SBUF = ACC;             //Send data to UART buffer
}

/*----------------------------
Send a string to UART
Input: s (address of string)
Output:None
----------------------------*/
void SendString(char *s)
{
    while (*s)              //Check the end of the string
    {
        SendData(*s++);     //Send current char and increment string ptr
    }
}


void Timer2() interrupt 5
{
	// 10us一次

	// 定时器2的TF2标志位必须手动清零
	TF2 = 0;

	// 行扫描----------------
	// 每扫描一次，全局变量rowIdx自加一，一直到15再回到0
	display();

