slipperstree/MyMcu51Prog/STC12C5A60S2/01_16x64LED/16x64LED_For89C52.c
	// 如果当前是显示串口文字模式则不进行左移
	if (isShowSerialData == 1) {
		return;
	}

	// 左移----------------
	ttTimer2++;
	// 当行扫描一帧结束时，并且滚动时间间隔到了
	// 进行左移
	// 判断rowIdx=0的作用是，左移处理只允许在画面完整的一帧扫描完以后才可以做
	// 这样可以避免画面闪烁。因为左移处理中需要读取字库芯片等耗时的操作
	// 如果任意打断画面扫描，整个画面会不规则闪烁
	// 最理想的是每两行扫描之间的那点时间足够执行完左移操作
	// 也就是左移花费的时间要尽量少于当前定时器0的中断间隔
	if ( rowIdx == 0 && ttTimer2 >= SCROLL_SPEED) {
		ttTimer2 = 0;
		// 左移1位
		//EN_port = 1; //off screen
		shiftLeft();
		//EN_port = 0; //on screen
	}
}

// 画面左移一位
void shiftLeft() {

	uchar idx = 0;

	// 从IC取得右侧将要移入的列数据（上下各一个字节）
	// 第一个字节用来返回是Ascii码还是汉字，以便移位offset的重置
	uchar shiftInColData[3] = {0x00,0x00,0x00};
	getICData_Col(&textForShow[nowShowTextPos+8], nowShiftOffset, shiftInColData);

	// 大Buffer全体左移一位
	for (idx=0; idx<128; idx++){
		// 先左移1位
		bufHZ[idx]<<=1;
		// 最低位用相邻右侧数据的最高位填充
		bufHZ[idx] |= ((bufHZ[idx+16]>>7)&0x01);
	}

	// 取到的上下两个纵列字节()的数据的每一位写入大buffer最右侧
	// 也就是写入B112-B127这16个字节的最低位
	// <大Buff最右侧数据>
	// B112   ...bit0 <- shiftInColData[1]的 bit0
	// ...
	// B119   ...bit0 <- shiftInColData[1]的 bit7
	// B120   ...bit0 <- shiftInColData[2]的 bit0
	// ...
	// B127   ...bit0 <- shiftInColData[2]的 bit7
	for(idx = 0; idx < 8; idx++)
	{
		bufHZ[idx+112] &= 0xFE; // 112-119 清零最低位
		bufHZ[idx+120] &= 0xFE; // 120-127 清零最低位
		
		if ((shiftInColData[1]<<(7-idx) & 0x80) == 0x80 )  {
			bufHZ[idx+112] |= 0x01; // 112-119 最低位置1
		}

		if ((shiftInColData[2]<<(7-idx) & 0x80) == 0x80 )  {
			bufHZ[idx+120] |= 0x01; // 120-127 最低位置1
		}
	}

	// 偏移量加一，通知显示子函数刷新画面
	if(shiftInColData[0] == 0){
		// 当前移进来的字符是Ascii码8位宽度
		if(nowShiftOffset==7){
			nowShiftOffset=0;
			nowShowTextPos+=1;  // 全部移动完成后，当前显示文字位置向后移动1个字节（一个Ascii即1个字节）
			if(nowShowTextPos>=(showDataSize-8)) nowShowTextPos=-8;
		} else {
			nowShiftOffset++;
		}
	} else {
		// 当前移进来的字符是汉字16位宽度
		if(nowShiftOffset==15){
			nowShiftOffset=0;
			nowShowTextPos+=2;  // 全部移动完成后，当前显示文字位置向后移动2个字节（一个汉字即2个字节）
			if(nowShowTextPos>=(showDataSize-8)) nowShowTextPos=-8;
		} else {
			nowShiftOffset++;
		}
	}
	
}

// 取得指定文字的指定列的点阵数据（两个字节）
// 返回参数结构：
//    colData[0] : 返回是否为Asc/汉字标志位。0为Ascii,1为汉字。
//    colData[1] : 返回指定列 上半部分数据
//    colData[2] : 返回指定列 下半部分数据
void getICData_Col(uchar* str, uchar colIdx, uchar* colData)
{
	unsigned long hzGBCodeH8, hzGBCodeL8;

	// 先清空目标字节
	colData[0] = 0x00; //返回是否为Asc/汉字标志位。0为Ascii,1为汉字。 
	colData[1] = 0x00; //返回指定列 上半部分数据
	colData[2] = 0x00; //返回指定列 下半部分数据

	// 计算点阵所在地址
	// GB2312-80编码的编码范围是高位0xa1－0xfe，低位是 0xa1-0xfe ，
	// 其中汉字范围为 0xb0a1 和 0xf7fe，如果只是简单地判断汉字，则只要查看高字节是否大于等于0xa1就可以了
	if (str[0] >= 0x20 && str[0] <= 0x7E) {
		// ASCII字符
		addr = (str[0]-0x20)*16+0x3b7c0;

		// 只需要指定列的2个字节，分两次取单字节
		colData[1] = getICData(addr+colIdx, 1)[0];
		colData[2] = getICData(addr+colIdx+8, 1)[0];

		colData[0] = 0;
	} else {
		// 全角汉字
		// 由于后面有地址的计算，所以必须使用可容纳大数的long型作为中间变量，否则做地址运算时会溢出
		// 直接将uchar型赋值给long型的话，没有赋值到的高位有可能乱掉，所以跟0xFF相与一次，确保只留下uchar部分的数据
		hzGBCodeH8 = str[0] & 0xFF;
		hzGBCodeL8 = str[1] & 0xFF;

		// GB2312汉字所在地址的计算公式
		if(hzGBCodeH8 ==0xA9 && hzGBCodeL8 >=0xA1)
			addr = (282 + (hzGBCodeL8 - 0xA1 ))*32;
		else if(hzGBCodeH8 >=0xA1 && hzGBCodeH8 <= 0xA3 && hzGBCodeL8 >=0xA1)
			addr =( (hzGBCodeH8 - 0xA1) * 94 + (hzGBCodeL8 - 0xA1))*32;
		else if(hzGBCodeH8 >=0xB0 && hzGBCodeH8 <= 0xF7 && hzGBCodeL8 >=0xA1) {
			// addr = ((hzGBCodeH8 - 0xB0) * 94 + (hzGBCodeL8 - 0xA1)+ 846)*32;
			addr = (hzGBCodeH8 - 0xB0) * 94;
			addr += (hzGBCodeL8 - 0xA1) + 846;
			addr *= 32;
		}

		// 只需要整个汉字指定列的2个字节，分两次取单字节
		colData[1] = getICData(addr+colIdx, 1)[0];
		colData[2] = getICData(addr+colIdx+16, 1)[0];

		colData[0] = 1;
	}

	
}

// test---------------------------------------------------------------
// 将整个屏幕所有数据设置成同一个数据(如果传入0xFF就是全部点亮)
// 本函数用于测试LED板子，需要放在主程序while循环中才可以（模块需要不停扫描否则不显示）
void testSetFullScreenByte(uchar bData)
{
	uchar row=0;
	uchar i=0;
	uchar temp=0;
	Latch_port = 0;  /*HC595锁定输出,避免数据传输过程中，屏数据变化从而显示闪烁*/
	CLK_port = 0;
	
	for(row = 0; row < 16; row++)
	{
		for(temp=0;temp<8;temp++){
			for(i=0;i<8;i++){
				if(((bData<<i)&0x80)!=0) DA_in_port = 0;
				else DA_in_port = 1;
				CLK_port = 1;
				CLK_port = 0;
			}
		}

		EN_port = 1; /*关屏显示，原理为使HC138输出全为1，从而三极管截止，点阵不显示*/

		ABCD_port = (ABCD_port & 0x0f)|(row<<4);

		Latch_port = 1; /*允许HC595数据输出到Q1-Q8端口*/
		EN_port = 0; /*HC138输出有效，打开显示*/
		Latch_port = 0;	/*锁定HC595数据输出*/
	}
}